SOACWKBpel/test/PaymentTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/BpelModule2/src/newWSDL">
  <soapenv:Body>
    <new:CardPayment>
      <CardType>visa</CardType>
      <CardNumber>4222222222222</CardNumber>
      <part3>50000</part3>
    </new:CardPayment>
  </soapenv:Body>
</soapenv:Envelope>