SOACWKBpel/test/test/SearchCarTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/BpelModule2/src/newWSDL">
  <soapenv:Body>
    <new:findVehicle>
      <make>mercedes</make>
      <model>c180</model>
      <year>2005</year>
      <price>35000</price>
      <part5>1000</part5>
    </new:findVehicle>
  </soapenv:Body>
</soapenv:Envelope>