SOACWKBpel/test/CarOfferTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/BpelModule2/src/newWSDL">
  <soapenv:Body>
    <new:CarOffer>
       <VehiclePrice>10</VehiclePrice>
      <money>12</money>
    </new:CarOffer>
  </soapenv:Body>
</soapenv:Envelope>