SOACWKBpel/test/SaveLoanTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/BpelModule2/src/newWSDL">
  <soapenv:Body>
    <new:saveLoanProducts>
      <idLoan>1</idLoan>
      <part2>1</part2>
    </new:saveLoanProducts>
  </soapenv:Body>
</soapenv:Envelope>