SOACWKBpel/test/test/FileLoanApp/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/BpelModule2/src/newWSDL">
  <soapenv:Body>
    <new:fileLoanApp>
      <part1>1</part1>
    </new:fileLoanApp>
  </soapenv:Body>
</soapenv:Envelope>